app/controllers/client_workouts_controller.rb

  def index
    @client_workouts = ClientWorkout.all
---
SELECT * FROM "client_workouts"

  def show
    @client_workout = ClientWorkout.find(params[:id])
---
SELECT * FROM "client_workouts" WHERE ("client_workouts"."id" = 1)

  def create
    @client_workout = ClientWorkout.new(params[:client_workout])

    respond_to do |format|
      if @client_workout.save
---
INSERT INTO "client_workouts" ("updated_at", "client_name", "trainer", "paid_amount", "duration_mins", "date_of_workout", "created_at") VALUES('2011-01-31 13:43:19', 'bob', 'aaa', 50.0, 0, '2011-01-31', '2011-01-31 13:43:19')

  def find
    @client_workouts = ClientWorkout.all(:conditions => ["client_name = ? OR trainer = ?",
        params[:search_string],params[:search_string]])
---
SELECT * FROM "client_workouts" WHERE (client_name = 'aaaaaaaaaa' OR trainer = 'aaaaaaaaaa')